[
  {
    "name": "Tom Hakel",
    "role": "Chief Executive Officer at Synergy Marketing Associates, Inc.",
    "quote": "Gera is an INCREDIBLE collection of technologist, designer and innovator.  In addition, he has a deep sense of general business process and applies this knowledge to develop unique, functional websites and related software tool sets that simply work.  I would highly recommend Gera.",
    "photo": "/images/testimonials/tom_h.jpg",
    "highlight": "INCREDIBLE collection of technologist, designer and innovator",
    "rank": 100
  },
  {
    "name": "David Mercer",
    "role": "CEO at David Mercer Consulting, Inc.",
    "quote": "Gera is a thoughtful, focused person that relates well with people. He always looks to solutions to technological problems that can help his clients, and maintains an excellent work ethic.",
    "photo": "/images/testimonials/david_m.jpg",
    "highlight": "software tool sets that simply work",
    "rank": 100
  },
  {
    "name": "Verjel Cacayorin",
    "role": "Co-Founder & Director of Marketing and Operations at Virtulink Philippines",
    "quote": "It brings me great pleasure to recommend Gera. I have had the pleasure of working with Gera, and I can attest to his exceptional skills and professionalism.  Gera possesses a deep understanding of data analysis and software development, which he applies to various aspects of marketing such as SaaS/B2B/B2C Marketing, Customer Lifecycle, SEO-SEM, and Go-To-Market Strategy Development. What I appreciate most about working with Gera is his ability to listen to clients' needs and craft marketing strategies that exceed their expectations.  Above all, what I appreciate most about working with Gera is his positive attitude, team spirit, and commitment to delivering outstanding results. He is an outstanding professional and an asset to any team. If you're looking for a talented marketer who is easy to work with and can deliver exceptional results, look no further than Gera. I highly recommend him without any hesitation.",
    "photo": "/images/testimonials/verjel_c.jpg",
    "highlight": "ability to listen to clients' needs and craft marketing strategies that exceed their expectations",
    "rank": 95
  },
  {
    "name": "David Simpson",
    "role": "Consultant & Executive Director at Pax Vobiscum Consulting",
    "quote": "It's a joy and honor to recommend Gera. Not only is he an extremely nice man, not only is he excellent at his craft, not only is he creative and has phenomenal output, Gera is just a wonderful energy to have around the office. Upbeat, funny and engaging. You would be lucky  - like we have been - to work with him.",
    "photo": "/images/testimonials/david_s.jpg",
    "highlight": "wonderful energy to have around the office",
    "rank": 95
  },
  {
    "name": "Arsen Yeremin",
    "role": "Fractional CTO at Lilypad Network",
    "quote": "I’ve worked with Gera on many occasions on various projects. While I focus on details of implementation, thanks to his suggestions to overall strategy, it saved me enormous amount of time. ",
    "photo": "/images/testimonials/arsen_y.jpg",
    "highlight": "saved me enormous amount of time",
    "rank": 95
  },
  {
    "name": "Devon Swift",
    "role": "Digital Marketing Director at Waybeyond Marketing",
    "quote": "Gera was a great employee and mentor for me at Nuvolum. He took the extra time to show me how things were done, especially on the Wordpress side of the business when I got hired on. He's always the most positive and optimistic guy in the room and he can bring a lot of knowledge to any group. He is definitely a Wordpress wizard and his creativity with the platform makes him a powerful developer. It was a pleasure and a joy working with him on various web projects.",
    "photo": "/images/testimonials/devon_s.jpg",
    "highlight": "definitely a Wordpress wizard",
    "rank": 95
  },
  {
    "name": "Jenna Sherron Stutsman",
    "role": "Director of Public Relations and Account Management at Nuvolum",
    "quote": "Gera's positive attitude is infectious. He is so talented at inspiring others to do their best and reach for the stars. His commitment to excellence and great ideas make him a pleasure to work with. At Nuvolum, I could always count on him to produce an excellent product and give me expert support in an arena I knew little about - web design and SEO. I highly recommend Gera and I hope I get the chance to work with him in some capacity again some day. ",
    "photo": "/images/testimonials/jenna_s.jpg",
    "highlight": "positive attitude is infectious",
    "rank": 95
  },
  {
    "name": "Emily Barker",
    "role": "Director of Marketing and Outreach at SMILE Orthodontics",
    "quote": "Gera is a website wiz, who is always ready and excited for the next big thing. He has a way of explaining web jargon in a way that people understand and respond to.   I had the opportunity to work with Gera on numerous projects during our time at Nuvolum. He is easy and fun to collaborate with, has an upbeat and responsive personality, and always exceeds expectations. Without hesitation, I would HIGHLY recommend Gera, and hope I have the good fortune of working with him again. ",
    "photo": "/images/testimonials/emily_b.jpg",
    "highlight": "always exceeds expectations",
    "rank": 95
  },
  {
    "name": "Leslie Chalmers",
    "role": "Associate Art Director at Vaniam Group",
    "quote": "When it comes to marketing strategy, Gera is meticulous in both his analysis and execution of multi-faceted projects. I saw him succeed over and over again during our time together at Nuvolum. He has exceptional expertise in development and coding and he was always able to provide innovative solutions that made our products successful and reliable. Outside of his proven skill set, he is a joy to work with. He is a proactive communicator who always seemed to genuinely enjoy collaborating with people. Also - his passion for what he does is consistent and contagious, even during times of high stress. I enjoyed working with Gera and can't recommend him enough!",
    "photo": "/images/testimonials/leslie_c.jpg",
    "highlight": "meticulous in both his analysis and execution",
    "rank": 95
  },
  {
    "name": "Karen Serpa, MA",
    "role": "AVP - Marketing Communications Manager at Exchange Bank",
    "quote": "Gera is a results-driven and highly knowledgeable digital marketing strategist. He is efficient and welcomes every challenge with positivity, bringing integrity and value to each project. He is a great asset to any team lucky enough to have him. ",
    "photo": "/images/testimonials/karen_s.jpg",
    "highlight": "",
    "rank": 90
  },
  {
    "name": "Greg Jones",
    "role": "Founder at North Bay Networking Group",
    "quote": "Gera created a campaign for our North Bay Networking Group in November of 2012 that reached the highest response yet for our Eventbrite customers. Gera always told me his goal was to deliver great results for our group. He also made sure he understood our brand and I know he is a leader that I want to continue to do business with in the future. We plan on working on future projects and would be happy to talk to anyone about the exceptional service and results that Gera provided our company. He is a man with high integrity and passion for his work.",
    "photo": "/images/testimonials/greg_j.jpg",
    "highlight": "highest response yet",
    "rank": 75
  },
  {
    "name": "Bruce Corkhill",
    "role": "Owner at Live Everyday Like Friday ",
    "quote": "I have come to know Gera over the last several months and he has offered me unique perspectives on what I do and how I can accomplish my goals by branding my professional expertise in my current position.  Gera has a unique perspective of what companies are looking for in relation to service partnerships. He is quickly developing a level of expertise in Web Development, and business to business relationships.",
    "photo": "/images/testimonials/bruce_c.jpg",
    "highlight": "unique perspectives",
    "rank": 75
  },
  {
    "name": "George R. Moskoff",
    "role": "Owner at APG Construction Inc.",
    "quote": "Gera's got ideas on how to do marketing a bit differently and, now, I think they have some merit and warrant some attention.  He's good at asking the critical questions and \"drilling\" for understanding.  I'm pleased to know him and be able to experiment with some of his advice and counsel: I've had a pleasantly positive payoff by trying out some of his innovations.",
    "photo": "/images/testimonials/george_m.jpg",
    "highlight": "pleasantly positive payoff",
    "rank": 75
  },
  {
    "name": "David Petker",
    "role": "Owner at WoodPecker Roofing",
    "quote": "I cant say enough about how great it is to work with Gera he made my web site dreams come true, Things I was not even sure were possible, he whipped up in no time! I am very impressed with his dedication to his craft.",
    "photo": "",
    "highlight": "made my web site dreams come true",
    "rank": 75
  },
  {
    "name": "Ryan Herche",
    "role": "Operations Manager at Brookwood Investment Group, LLC",
    "quote": "Gera is a truly innovative thinker. His fresh approach and careful product  testing make a massive difference for his clients.  I would say the single greatest thing about Gera is his integrity. ",
    "photo": "/images/testimonials/Ryan_h.jpg",
    "highlight": "single greatest thing about Gera is his integrity",
    "rank": 70
  },
  {
    "name": "Julie Halpin",
    "role": "Sales Operations Manager  at Darey Brands",
    "quote": "We primarily hired Gera to help us speed up our website and optimize our plug-ins. He did that and much more, all at a reasonable price! We now have a fast website & a better user experience. Another added benefit is that it is now easier (and more fun) to manage the site as an administrator.",
    "photo": "/images/testimonials/julie_h.jpg",
    "highlight": "did that and much more",
    "rank": 70
  },
  {
    "name": "Nate Bauer",
    "role": "Senior Product Designer at Centene Corporation",
    "quote": "Gera's creative mind and his natural ability to lead makes him one of the most valuable people I've ever worked with. He is constantly learning something new and continues to grow in both ability and skill. Working with Gera was always something I looked forward too.",
    "photo": "/images/testimonials/nate_b.jpg",
    "highlight": "one of the most valuable people I've ever worked with",
    "rank": 65
  },
  {
    "name": "Emily Kischell",
    "role": "Content Quality Assurance Specialist and Technical Editor at QA North America",
    "quote": "I had the privilege of working closely with Gera in the closely-knit development team at Nuvolum for a year. He brought a truly remarkable sense of joy and positivity to our team every day, and his steadfast work ethic was inspiring. Any team that gets to work with Gera is a lucky group! ",
    "photo": "/images/testimonials/emily_k.jpg",
    "highlight": "remarkable sense of joy and positivity",
    "rank": 55
  },
  {
    "name": "Gloria Jakusz",
    "role": "Freelance Designer at Self-employed",
    "quote": "Gera is genuinely a great pleasure to work with on any day. His positivity and willingness to find solutions to any challenges big or small is impressive and a joy to witness. He carries a great deal of optimism paired with the ability to analyze all projects on a very sophisticated level. ",
    "photo": "/images/testimonials/gloria.jpg",
    "highlight": "positivity and willingness to find solutions",
    "rank": 40
  },
  {
    "name": "Mark Vargas",
    "role": "Data Engineer at Emerson Collective",
    "quote": "Gera is an end-to-end developer that absolutely checks all the boxes you need, and didn't know. If you can think it--he can develop it! Aside from his top-tier development skills, he has the collection of sharp business acumen, upbeat attitude, and clear articulation that makes him easy to work with. The collection of his skills are remarkable and rare, so if you ever have the chance to conduct business with any capacity, do not miss that chance!",
    "photo": "/images/testimonials/mark_v.jpg",
    "highlight": "If you can think it--he can develop it!",
    "rank": 40
  },
  {
    "name": "Anne Marie Petty",
    "role": "School Bus Driver at Shoreline Unified School Dist",
    "quote": "If you're looking for a talented, intelligent, dedicated developer, Gera's your guy! He's a true team player and always looking out for the best interest of the whole. He's humble and remains adaptable to frequently changing schedules and circumstances. One of the things I appreciated most about Gera during our time as co-workers was his enthusiastic attitude; he was always smiling and offering words of encouragement, appreciation, and inspiration. ",
    "photo": "/images/testimonials/anne_p.jpg",
    "highlight": "true team player",
    "rank": 40
  },
  {
    "name": "Brian Chock",
    "role": "Pastor at Foundation Christian Fellowship",
    "quote": "Gera has provided web-design and implementation of two websites that my wife and I are entrusted with: www.cjchildcare.com and www.foundationchristian.com. Gera shepherded us through the entire process and his prefessional expertise and his general caring attitude proved to be key attributes as my wife and I knew what we wanted but had no idea how to make it happen.    We also emply Gera as the IT Manager for our combined church/child care facility. Gera is always prompt and courteous when we call and has proven able to fix everything that has gone down as a result of either the hand of God and/or our inexperienced and unknowing hands.    I would heartily recommend Gera to anyone in need of the help I have just described.",
    "photo": "/images/testimonials/brian.jpg",
    "highlight": "professional expertise and his general caring attitude",
    "rank": 40
  }
]